adafruit/seesaw/lib/samd51/samd51a/edc/ATSAMD51J18A.PIC
      <edc:SFRDef edc:_addr="0x43002824" edc:access="-----nnnnnnnnnnnnnnn-nnnn-n---nn" edc:cname="RXCTRL" edc:impl="0x7FFF7A3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="I2S">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="SERMODE" edc:desc="Serializer Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="RX" edc:desc="Receive" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="PDM2" edc:desc="Receive one PDM data on each serial clock edge" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:desc="Clock Unit Selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="CLK0" edc:desc="Use Clock Unit 0" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CLK1" edc:desc="Use Clock Unit 1" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SLOTADJ" edc:desc="Data Slot Formatting Adjust" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="RIGHT" edc:desc="Data is right adjusted in slot" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LEFT" edc:desc="Data is left adjusted in slot" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATASIZE" edc:desc="Data Word Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="32" edc:desc="32 bits" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="24" edc:desc="24 bits" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="20" edc:desc="20 bits" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="18" edc:desc="18 bits" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16 bits" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="16C" edc:desc="16 bits compact stereo" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8 bits" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="8C" edc:desc="8 bits compact stereo" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WORDADJ" edc:desc="Data Word Formatting Adjust" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="RIGHT" edc:desc="Data is right adjusted in word" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LEFT" edc:desc="Data is left adjusted in word" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EXTEND" edc:desc="Data Formatting Bit Extension" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="ZERO" edc:desc="Extend with zeroes" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ONE" edc:desc="Extend with ones" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MSBIT" edc:desc="Extend with Most Significant Bit" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="LSBIT" edc:desc="Extend with Least Significant Bit" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BITREV" edc:desc="Data Formatting Bit Reverse" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MSBIT" edc:desc="Transfer Data Most Significant Bit (MSB) first (default for I2S protocol)" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LSBIT" edc:desc="Transfer Data Least Significant Bit (LSB) first" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SLOTDIS0" edc:desc="Slot 0 Disabled for this Serializer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS1" edc:desc="Slot 1 Disabled for this Serializer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS2" edc:desc="Slot 2 Disabled for this Serializer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS3" edc:desc="Slot 3 Disabled for this Serializer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS4" edc:desc="Slot 4 Disabled for this Serializer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS5" edc:desc="Slot 5 Disabled for this Serializer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS6" edc:desc="Slot 6 Disabled for this Serializer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS7" edc:desc="Slot 7 Disabled for this Serializer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MONO" edc:desc="Mono Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="STEREO" edc:desc="Normal mode" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MONO" edc:desc="Left channel data is duplicated to right channel" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DMA" edc:desc="Single or Multiple DMA Channels" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="Single DMA channel" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MULTIPLE" edc:desc="One DMA channel per data channel" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RXLOOP" edc:desc="Loop-back Test Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
